LEXICON_COMMANDS = {
    "/start": "Запуск бота",
    "/help": "Помощь",
}

LEXICON = {
    "start": "🎓 Привет! Я — бот-расписание.\n\n"
    "Здесь ты можешь узнать актуальное расписание занятий, изменения и переносы пар.\n\n"
    "👇 Выбери свой факультет, чтобы продолжить:",
    "help": "",
    "choice_group": "Вы выбрали факультет: {faculty_name}\n\nТеперь выберите группу, в которой вы обучаетесь:",
    "schedule_message": "Группа: {group_name}\n\nТекущая неделя: {current_week}\n\n"
    "<blockquote>{final_schedule}</blockquote>\n\n"
    "Нажмите на <b>{current_day}</b> чтобы изменить чётность недели."
    "\n\nСменить группу: /start\nПомощь: /help",
    "schedule": """
📚 Пара {i}.
⏰ {time} 
📖 {subject_name}  
🏛 Аудитория: {aud}
""",
}

LEXICON_INLINE_KEYBOARDS_TYPES = {
    "faculties": "faculty",
    "groups": "group",
}

LEXICON_DAYS_RU = [
    "Понедельник",
    "Вторник",
    "Среда",
    "Четверг",
    "Пятница",
    "Суббота",
    "Воскресенье",
]


LEXICON_PARITY = ["ч.", "н."]
